import { createSlice } from '@reduxjs/toolkit';
import imgNancyChair from '../../assets/images/featuredProducts/nancy-chair.png';
import imgArtDecoHome from '../../assets/images/featuredProducts/art-deco-home.png';
import imgTableWoodPine from '../../assets/images/featuredProducts/table-wood-pine.png';

export const $_products = createSlice({
    name: '_products',
    initialState: {
        data: [
            {
                id: 1,
                qty: 1,
                name: 'صندلی نانسی',
                price: 7_000_000,
                oldPrice: null,
                inventory: 7,
                desc: 'این صندلی یک صندلی عالی است',
                imgUrl: imgNancyChair,
                cat: 'مبلمان',
                tag: 'صندلی',
                tabs: {
                    fullDesc: [
                        {
                            title: 'توضیحات',
                            items: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                        },
                        {
                            title: 'ویژگی ها',
                            items: [
                                'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                                'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                                'آستین تبلت با روکش تریکو داخلی',
                                'دارای یک محفظه اصلی بزرگ و زیپدار',
                                'پارچه بوم نخی درجه یک'
                            ]
                        }
                    ],
                    comments: [],
                    specifications: [
                        ['وزن', '1.2 کیلوگرم'],
                        ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
                    ]
                }
            },
            {
                id: 2,
                qty: 1,
                name: 'میز چوب کاج',
                price: 1_500_000,
                oldPrice: null,
                inventory: 4,
                desc: 'این میز یک میز عالی است',
                imgUrl: imgTableWoodPine,
                cat: 'مبلمان',
                tag: 'میز',
                tabs: {
                    fullDesc: [
                        {
                            title: 'توضیحات',
                            items: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                        },
                        {
                            title: 'ویژگی ها',
                            items: [
                                'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                                'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                                'آستین تبلت با روکش تریکو داخلی',
                                'دارای یک محفظه اصلی بزرگ و زیپدار',
                                'پارچه بوم نخی درجه یک'
                            ]
                        }
                    ],
                    comments: [],
                    specifications: [
                        ['وزن', '1.2 کیلوگرم'],
                        ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
                    ]
                }
            },
            {
                id: 3,
                qty: 1,
                name: 'گلدان چوبی',
                price: 100_000,
                oldPrice: null,
                inventory: 0,
                desc: 'این گلدان یک گلدان عالی است',
                imgUrl: imgArtDecoHome,
                cat: 'دکوراسیون',
                tag: 'دکور',
                tabs: {
                    fullDesc: [
                        {
                            title: 'توضیحات',
                            desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                        },
                        {
                            title: 'ویژگی ها',
                            items: [
                                'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                                'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                                'آستین تبلت با روکش تریکو داخلی',
                                'دارای یک محفظه اصلی بزرگ و زیپدار',
                                'پارچه بوم نخی درجه یک'
                            ]
                        }
                    ],
                    comments: [],
                    specifications: [
                        ['وزن', '1.2 کیلوگرم'],
                        ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
                    ]
                }
            },
        ]
    },
    // reducers: {
    //     goRight: state => {
    //         if(state.status !== -((state.limit - 4) * state.translation)) 
    //             state.status -= state.translation;
    //     },
    // }
});

// export const { goRight } = $_products.actions;