import img1 from '../assets/images/products/585x585 (1).jpg';
import img2 from '../assets/images/products/585x585 (2).jpg';
import img3 from '../assets/images/products/585x585 (3).jpg';
import img4 from '../assets/images/products/585x585 (4).jpg';
import img5 from '../assets/images/products/585x585 (5).jpg';
import img6 from '../assets/images/products/585x585 (6).jpg';
import img7 from '../assets/images/products/585x585 (7).jpg';
import img8 from '../assets/images/products/585x585 (8).jpg';
import img9 from '../assets/images/products/585x585 (9).jpg';
import img10 from '../assets/images/products/585x585 (10).jpg';
import img11 from '../assets/images/products/585x585 (11).jpg';
import img12 from '../assets/images/products/585x585 (12).jpg';

export type T_FullDesc = {
    title: string
} & (
    { items?: string[]; } |
    { desc?: string }
)

export type T_Product = {
    id: number,
    name: string,
    qty?: number;
    price: number,
    oldPrice: number | null,
    inventory: number,
    desc: string,
    imgUrl: string,
    cat: string,
    tag: string,
    tabs: {
        fullDesc: T_FullDesc[],
        comments: [],
        specifications: [string, string][],
    }
}

export const productData: T_Product[] = [
    {
        id: 1,
        // qty: undefined,
        name: 'گلدان چوبی',
        price: 100_000,
        oldPrice: null,
        inventory: 0,
        desc: 'این گلدان یک گلدان عالی است',
        imgUrl: img1,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 2,
        // qty: undefined,
        name: 'میز چوب کاج',
        price: 1_500_000,
        oldPrice: null,
        inventory: 4,
        desc: 'این میز یک میز عالی است',
        imgUrl: img2,
        cat: 'مبلمان',
        tag: 'میز',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    items: ['لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم']
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 3,
        // qty: undefined,
        name: 'کوزه سبز تیره',
        price:85_000,
        oldPrice: 90_000,
        inventory: 4,
        desc: 'این کوزه یک کوزه عالی است',
        imgUrl: img3,
        cat: 'مبلمان',
        tag: 'میز',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    items: [
                        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                    ]
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 4,
        // qty: undefined,
        name: 'لیوان نوشیدنی',
        price: 20_000,
        oldPrice: null,
        inventory: 2,
        desc: 'این لیوان یک لیوان عالی است',
        imgUrl: img4,
        cat: 'دکوراسیون',
        tag: 'میز',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 5,
        // qty: undefined,
        name: 'صندلی هلن',
        price: 900_000,
        oldPrice: 1_000_000,
        inventory: 3,
        desc: 'این صندلی یک صندلی عالی است',
        imgUrl: img5,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 6,
        // qty: undefined,
        name: 'آباژور',
        price: 500_000,
        oldPrice: null,
        inventory: 2,
        desc: 'این آباژور یک آباژور عالی است',
        imgUrl: img6,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 7,
        // qty: undefined,
        name: 'صندلی نانسی',
        price: 7_000_000,
        oldPrice: null,
        inventory: 7,
        desc: 'این صندلی یک صندلی عالی است',
        imgUrl: img7,
        cat: 'مبلمان',
        tag: 'صندلی',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    items: [
                        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                    ]
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 8,
        // qty: undefined,
        name: 'صندلی چوبی سفید',
        price: 300_000,
        oldPrice: null,
        inventory: 0,
        desc: 'این صندلی یک صندلی عالی است',
        imgUrl: img8,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 9,
        // qty: undefined,
        name: 'کاکتوس مصنوعی',
        price: 20_000,
        oldPrice: null,
        inventory: 0,
        desc: 'این محصول یک محصول عالی است',
        imgUrl: img9,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 10,
        // qty: undefined,
        name: 'لیوان چوبی',
        price: 730_000,
        oldPrice: null,
        inventory: 5,
        desc: 'این لیوان یک لیوان عالی است',
        imgUrl: img10,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 11,
        // qty: undefined,
        name: 'استوانه چوبی',
        price: 200_000,
        oldPrice: null,
        inventory: 0,
        desc: 'این محصول یک محصول عالی است',
        imgUrl: img11,
        cat: 'اکسسوری',
        tag: 'اکسسوری ها',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
    {
        id: 12,
        // qty: undefined,
        name: 'قوری فلزی',
        price: 100_000,
        oldPrice: null,
        inventory: 0,
        desc: 'این صندلی یک صندلی عالی است',
        imgUrl: img12,
        cat: 'دکوراسیون',
        tag: 'دکور',
        tabs: {
            fullDesc: [
                {
                    title: 'توضیحات',
                    desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم'
                },
                {
                    title: 'ویژگی ها',
                    items: [
                        'آستین بالشتک داخلی مناسب لپ تاپ 15 اینچی است',
                        'پنل پشتی کاملاً پددار شده، دسته ی تحت وب',
                        'آستین تبلت با روکش تریکو داخلی',
                        'دارای یک محفظه اصلی بزرگ و زیپدار',
                        'پارچه بوم نخی درجه یک'
                    ]
                }
            ],
            comments: [],
            specifications: [
                ['وزن', '1.2 کیلوگرم'],
                ['ابعاد', '12 x 2 x 1.5 سانتی متر'],
            ]
        }
    },
]